# NameUndoEvent

## Description
Procedure NameUndoEvent names the undo event that is currently being built by VectorScript execution. Parameter eventName is the name of the undo event.

```pascal
PROCEDURE NameUndoEvent(eventName : STRING);
```

```python

def vs.NameUndoEvent(eventName):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|eventName|STRING|Name of undo event.|

## Remarks
Names the undo event that is currently being built.

## Version
Availability: from VectorWorks8.0
## Category
* Utility